
import { SyllabusItem } from './types';

export const SYLLABUS: SyllabusItem[] = [
  {
    name: 'Higher Math',
    icon: 'fa-calculator',
    papers: {
      '1st Paper': [
        'অধ্যায় ০১: ম্যাট্রিক্স ও নির্ণায়ক',
        'অধ্যায় ০২: ভেক্টর',
        'অধ্যায় ০৩: সরলরেখা',
        'অধ্যায় ০৪: বৃত্ত',
        'অধ্যায় ০৫: বিন্যাস ও সমাবেশ',
        'অধ্যায় ০৬: ত্রিকোণমিতিক অনুপাত',
        'অধ্যায় ০৭: সংযুক্ত কোণের ত্রিকোণমিতিক অনুপাত',
        'অধ্যায় ০৮: ফাংশন ও ফাংশনের লেখচিত্র',
        'অধ্যায় ০৯: অন্তরীকরণ',
        'অধ্যায় ১০: যোগজীকরণ'
      ],
      '2nd Paper': [
        '১ম অধ্যায়: বাস্তব সংখ্যা ও অসমতা',
        '২য় অধ্যায়: যোগাশ্রয়ী প্রোগ্রাম',
        '৩য় অধ্যায়: জটিল সংখ্যা',
        '৪থ অধ্যায়: বহুপদী ও বহুপদী সমীকরণ',
        '৫ম অধ্যায়: দ্বিপদী বিস্তৃতি',
        '৬ষ্ঠ অধ্যায়: কণিক',
        '৭ম অধ্যায়: বিপরীত ত্রিকোণমিতি ও ত্রিকোণমিতিক',
        '৮ম অধ্যায়: স্থিতিবিদ্যা',
        '৯ম অধ্যায়: সমতলে বস্তুকণার গতি',
        '১০ম অধ্যায়: যোগজীকরণ'
      ]
    }
  },
  {
    name: 'Physics',
    icon: 'fa-atom',
    papers: {
      '1st Paper': [
        'অধ্যায় ০১- ভৌতজগৎ ও পরিমাপ',
        'অধ্যায় ০২-ভেক্টর',
        'অধ্যায় ০৩- গতিবিদ্যা',
        'অধ্যায় ০৪- নিউটনীয় বলবিদ্যা',
        'অধ্যায় ০৫- কাজ শক্তি ও ক্ষমতা',
        'অধ্যায় ০৬- মহাকর্ষ ও অভিকর্ষ',
        'অধ্যায় ০৭- পদার্থের গাঠনিক ধর্ম',
        'অধ্যায় ০৮- পর্যাবৃত্ত গতি',
        'অধ্যায় ১০- গ্যাসের গতি তত্ত্ব'
      ],
      '2nd Paper': [
        'অধ্যায় ০১ - তাপ গতি বিদ্যা',
        'অধ্যায় ০২ -স্থির তড়িৎ',
        'অধ্যায় ০৩ - চল তড়িৎ',
        'অধ্যায় ০৪ - তড়িৎ প্রবাহের চৌম্বক ক্রিয়া ও চুম্বকত্ব',
        'অধ্যায় ০৫ - তাড়িতচৌম্বকীয় আবেশ ও পরিবর্তী প্রবাহ',
        'অধ্যায় ০৬ - জ্যামিতিক আলোকবিজ্ঞান',
        'অধ্যায় ০৭ - ভৌত আলোকবিজ্ঞান',
        'অধ্যায় ০৮ - আধুনিক পদার্থ বিজ্ঞান',
        'অধ্যায় ০৯ - পরমাণুর মডেল এবং নিউক্লিয়ার',
        'অধ্যায় ১০ - সেমিকন্ডাক্টর ও ইলেকট্রনিক্স',
        'অধ্যায় ১১ - জ্যোতি বিজ্ঞান'
      ]
    }
  },
  {
    name: 'Chemistry',
    icon: 'fa-flask',
    papers: {
      '1st Paper': [
        'অধ্যায় ০১ - ল্যাবরেটরির নিরাপদ ব্যবহার',
        'অধ্যায় ০২ - গুণগত রসায়ন',
        'অধ্যায় ০৩- মৌলের পর্যাবৃত্ত ধর্ম ও রাসায়নিক',
        'অধ্যায় ০৪- রাসায়নিক পরিবর্তন',
        'অধ্যায় ০৫- কর্মমুখী রসায়ন'
      ],
      '2nd Paper': [
        'অধ্যায় ০১- পরিবেশ রসায়ন',
        'অধ্যায় ০২- জৈব রসায়ন',
        'অধ্যায় ০৩- পরিমাণগত রসায়ন',
        'অধ্যায় ০৪- তড়িৎ রসায়ন',
        'অধ্যায় ০৫- অর্থনৈতিক রসায়ন'
      ]
    }
  },
  {
    name: 'Biology',
    icon: 'fa-dna',
    papers: {
      '1st Paper': [
        'অধ্যায় - ১: কোষ ও এর গঠন',
        'অধ্যায় - ২: কোষ বিভাজন',
        'অধ্যায় - ৩: কোষ রসায়ন',
        'অধ্যায় - ৪: অণুজীব',
        'অধ্যায় - ৫: শৈবাল ও ছত্রাক',
        'অধ্যায় - ৬: ব্রায়োফাইটা ও টেরিডোফাইটা',
        'অধ্যায় - ৭: নগ্নবীজী ও আবৃতবীজী উদ্ভিদ',
        'অধ্যায় - ৮: টিস্যু ও টিস্যুতন্ত্র',
        'অধ্যায় - ৯: উদ্ভিদ শারীরতত্ত্ব',
        'অধ্যায় - ১০: উদ্ভিদ প্রজনন',
        'অধ্যায় - ১১: জীবপ্রযুক্তি',
        'অধ্যায় - ১২: জীবের পরিবেশ, বিস্তার ও সংরক্ষণ'
      ],
      '2nd Paper': [
        'অধ্যায় ০১- প্রাণীর বিভিন্নতা ও শ্রেণিবিন্যাস',
        'অধ্যায় ০২- প্রাণীর পরিচিতি',
        'অধ্যায় ০৩- মানব শারীরতত্ত্ব-পরিপাক ও শোষণ',
        'অধ্যায় ০৪- মানব শারীরতত্ত্ব -রক্ত',
        'অধ্যায় ০৫- মানব শারীরতত্ত্ব-শ্বসন ও শ্বাসক্রিয়া',
        'অধ্যায় ০৬- মানব শারীরতত্ত্ব-বর্জ্য ও নিষ্কাশন',
        'অধ্যায় ০৭- মানব শারীরতত্ত্ব-চলন ও অঙ্গচালনা',
        'অধ্যায় ০৮- মানব শারীরতত্ত্ব-সমন্বয় ও নিয়ন্ত্রণ',
        'অধ্যায় ০৯- মানব জীবনের ধারাবাহিকতা',
        'অধ্যায় ১০- মানবদেহের প্রতিরক্ষা',
        'অধ্যায় ১১- জিনতত্ত্ব ও বিবর্তন',
        'অধ্যায় ১২-প্রাণীর আচরণ'
      ]
    }
  }
];
